Merge pull request #2 from soneylegal/feat/container-metrics
Feat/container metrics
